<h2>Pandas - DataFrames</h2>

In [2]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [18]:
np.random.randn(5,4)

array([[-9.93263500e-01,  1.96799505e-01, -1.13664459e+00,
         3.66479606e-04],
       [ 1.02598415e+00, -1.56597904e-01, -3.15791439e-02,
         6.49825833e-01],
       [ 2.15484644e+00, -6.10258856e-01, -7.55325340e-01,
        -3.46418504e-01],
       [ 1.47026771e-01, -4.79448039e-01,  5.58769406e-01,
         1.02481028e+00],
       [-9.25874259e-01,  1.86286414e+00, -1.13381716e+00,
         6.10477908e-01]])

<h3>Crear un DataFrame</h3>

In [8]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [37]:
df # Cada columna es una serie de Pandas

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

<h3>Seleccionar columna - fila - subconjunto de un DataFrame</h3>
<p>Seleccionar columna</p>

In [15]:
df['W'] # De esta manera tomo una columna. Se ve como una Serie, lo es.
# type(df['W'])
# df.W # Esta es otra forma de tomar la columna 'W'

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [39]:
df[['W','Y']] # Para tomar mas de una columna

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

<p>Seleccionar filas</p>

In [41]:
df.loc['D'] # Devuelve una fila, que tambien es una serie.

W   -0.497104
X   -0.754070
Y   -0.943406
Z    0.484752
Name: D, dtype: float64

In [43]:
# Con iloc puedo pasar numeros para obtener una fila a pesar de que los labels sean string
df.loc['C']
df.iloc[2] # Igual a loc ['C']

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

<p>Para obtener un elemento</p>

In [45]:
df.loc['A', 'Y']

-1.7060859307350775

<p>Para obtener un subconjunto</p>

In [46]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

<h3>Agregar columna a un DataFrame</h3>
<p>Simplemente hay que declarar la columna como si existiera</p>

In [21]:
# Por ejemplo, creo la nueva columna como la suma de otras dos
df['new'] = df['W'] + df['Z'] 
df['new']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

<h3>Remover columna de un DataFrame</h3>
<p>Remover columna</p>

In [24]:
df.drop('new', axis = 1, inplace = True) # axis = 1 refiere a las columnas, de lo contrario devolveria error. Inplace = True para que quede el cambio.

In [25]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

<p>Remover fila</p>

In [27]:
df.drop('E') # No es necesario indicar axis = 0 ya que por defecto es a las filas.

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752